PaolaJocelyn/Puerto-COM_labview-Actor-Framework/Proyecto final labview/Proyecto final labview/board/pin_mux.h
/*! @name PIO0_2 (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
#define BOARD_ISP_FC3_MISO_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ISP_FC3_MISO_PIN 2U  /*!<@brief 0U pin index: 2 */
                                   /* @} */

/*! @name PIO0_0 (coord D6), U26[13]/J14[4]/P0_0-ISP_FC3_SCK
  @{ */
#define BOARD_ISP_FC3_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ISP_FC3_SCK_PIN 0U  /*!<@brief 0U pin index: 0 */
                                  /* @} */

/*! @name PIO3_13 (coord H4), J14[8]/P3_13-BRIDGE_GPIO
  @{ */
#define BOARD_BRIDGE_GPIO_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_BRIDGE_GPIO_PORT 3U   /*!<@brief PORT device name: 3U */
#define BOARD_BRIDGE_GPIO_PIN 13U   /*!<@brief 3U pin index: 13 */
                                    /* @} */

/*! @name PIO0_13 (coord F11), JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX
  @{ */
#define BOARD_ISP_FC1_SDAX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ISP_FC1_SDAX_PIN 13U /*!<@brief 0U pin index: 13 */
                                   /* @} */

/*! @name PIO0_14 (coord E13), JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX
  @{ */
#define BOARD_ISP_FC1_SCLX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ISP_FC1_SCLX_PIN 14U /*!<@brief 0U pin index: 14 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGEPins(void); /* Function assigned for the Cortex-M4F */

#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO34_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO34_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO3_23 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
#define BOARD_FC2_SDAX_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_FC2_SDAX_PIN 23U /*!<@brief 3U pin index: 23 */
                               /* @} */

/*! @name PIO3_24 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
#define BOARD_FC2_SCLX_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_FC2_SCLX_PIN 24U /*!<@brief 3U pin index: 24 */
                               /* @} */

/*! @name PIO3_4 (coord B11), J12[10]/U19[3]/P3_4-ACCL_INTR
  @{ */
#define BOARD_ACCL_INTR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_ACCL_INTR_PORT 3U   /*!<@brief PORT device name: 3U */
#define BOARD_ACCL_INTR_PIN 4U    /*!<@brief 3U pin index: 4 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M4F */

#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_26 (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_SPIFI_CLK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_CLK_PIN 26U /*!<@brief 0U pin index: 26 */
                                /* @} */

/*! @name PIO0_24 (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_SPIFI_IO0_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_IO0_PIN 24U /*!<@brief 0U pin index: 24 */
                                /* @} */

/*! @name PIO0_25 (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_SPIFI_IO1_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_IO1_PIN 25U /*!<@brief 0U pin index: 25 */
                                /* @} */

/*! @name PIO0_27 (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3
  @{ */
#define BOARD_SPIFI_IO3_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_IO3_PIN 27U /*!<@brief 0U pin index: 27 */
                                /* @} */

/*! @name PIO0_28 (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
#define BOARD_SPIFI_IO2_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_IO2_PIN 28U /*!<@brief 0U pin index: 28 */
                                /* @} */

/*! @name PIO0_23 (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
#define BOARD_SPIFI_CSn_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPIFI_CSn_PIN 23U /*!<@brief 0U pin index: 23 */
                                /* @} */

/*! @name PIO2_12 (coord M2), U26A1[3]/P2_12-SPIFI_RSTn
  @{ */
#define BOARD_SPIFI_RSTn_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_SPIFI_RSTn_PORT 2U   /*!<@brief PORT device name: 2U */
#define BOARD_SPIFI_RSTn_PIN 12U   /*!<@brief 2U pin index: 12 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASHPins(void); /* Function assigned for the Cortex-M4F */

#define PIO210_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO210_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO23_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO23_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO24_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO24_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO25_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO25_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO26_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO26_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO27_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO27_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO28_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO28_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO29_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO29_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO315_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO315_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO3_15 (coord D2), RP1[1]/U9[8]/P3_15-SD_WPn
  @{ */
#define BOARD_SD_WPn_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_SD_WPn_PIN 15U /*!<@brief 3U pin index: 15 */
                             /* @} */

