PaolaJocelyn/Puerto-COM_labview-Actor-Framework/Proyecto final labview/Proyecto final labview/board/pin_mux.h
/*! @name PIO1_24 (coord N14), U28[G1]/P1_24-EMC_A12
  @{ */
#define BOARD_EMC_A12_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A12_PIN 24U /*!<@brief 1U pin index: 24 */
                              /* @} */

/*! @name PIO1_23 (coord M10), U28[G2]/P1_23-EMC_A11
  @{ */
#define BOARD_EMC_A11_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A11_PIN 23U /*!<@brief 1U pin index: 23 */
                              /* @} */

/*! @name PIO1_16 (coord B7), U28[H9]/P1_16-EMC_A10
  @{ */
#define BOARD_EMC_A10_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A10_PIN 16U /*!<@brief 1U pin index: 16 */
                              /* @} */

/*! @name PIO1_27 (coord F10), U28[G3]/P1_27-EMC_A9
  @{ */
#define BOARD_EMC_A9_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A9_PIN 27U /*!<@brief 1U pin index: 27 */
                             /* @} */

/*! @name PIO1_26 (coord J10), U28[H1]/P1_26-EMC_A8
  @{ */
#define BOARD_EMC_A8_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A8_PIN 26U /*!<@brief 1U pin index: 26 */
                             /* @} */

/*! @name PIO1_8 (coord P8), U28[H2]/P1_8-EMC_A7
  @{ */
#define BOARD_EMC_A7_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A7_PIN 8U  /*!<@brief 1U pin index: 8 */
                             /* @} */

/*! @name PIO1_7 (coord N1), U28[H3]/P1_7-EMC_A6
  @{ */
#define BOARD_EMC_A6_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A6_PIN 7U  /*!<@brief 1U pin index: 7 */
                             /* @} */

/*! @name PIO1_6 (coord G4), U28[J2]/P1_6-EMC_A5
  @{ */
#define BOARD_EMC_A5_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A5_PIN 6U  /*!<@brief 1U pin index: 6 */
                             /* @} */

/*! @name PIO1_5 (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
#define BOARD_EMC_A4_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_A4_PIN 5U  /*!<@brief 1U pin index: 5 */
                             /* @} */

/*! @name PIO0_21 (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
#define BOARD_EMC_A3_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_A3_PIN 21U /*!<@brief 0U pin index: 21 */
                             /* @} */

/*! @name PIO0_20 (coord D13), U28[J8]/P0_20-EMC_A2
  @{ */
#define BOARD_EMC_A2_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_A2_PIN 20U /*!<@brief 0U pin index: 20 */
                             /* @} */

/*! @name PIO0_19 (coord C6), U28[H8]/P0_19-EMC_A1
  @{ */
#define BOARD_EMC_A1_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_A1_PIN 19U /*!<@brief 0U pin index: 19 */
                             /* @} */

/*! @name PIO0_18 (coord C14), U28[H7]/P0_18-EMC_A0
  @{ */
#define BOARD_EMC_A0_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_A0_PIN 18U /*!<@brief 0U pin index: 18 */
                             /* @} */

/*! @name PIO0_15 (coord L4), U28[F9]/P0_15-EMC_WEn
  @{ */
#define BOARD_EMC_WEn_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_WEn_PIN 15U /*!<@brief 0U pin index: 15 */
                              /* @} */

/*! @name PIO1_9 (coord K6), U28[F7]/P1_9-EMC_CASn
  @{ */
#define BOARD_EMC_CASn_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_CASn_PIN 9U  /*!<@brief 1U pin index: 9 */
                               /* @} */

/*! @name PIO1_10 (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
#define BOARD_EMC_RASn_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_RASn_PIN 10U /*!<@brief 1U pin index: 10 */
                               /* @} */

/*! @name PIO1_12 (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_EMC_DYCSn0_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_DYCSn0_PIN 12U /*!<@brief 1U pin index: 12 */
                                 /* @} */

/*! @name PIO1_31 (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
#define BOARD_EMC_D15_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D15_PIN 31U /*!<@brief 1U pin index: 31 */
                              /* @} */

/*! @name PIO1_30 (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
#define BOARD_EMC_D14_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D14_PIN 30U /*!<@brief 1U pin index: 30 */
                              /* @} */

/*! @name PIO1_29 (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
#define BOARD_EMC_D13_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D13_PIN 29U /*!<@brief 1U pin index: 29 */
                              /* @} */

/*! @name PIO1_28 (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
#define BOARD_EMC_D12_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D12_PIN 28U /*!<@brief 1U pin index: 28 */
                              /* @} */

/*! @name PIO1_4 (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_EMC_D11_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D11_PIN 4U  /*!<@brief 1U pin index: 4 */
                              /* @} */

/*! @name PIO1_21 (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
#define BOARD_EMC_D10_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D10_PIN 21U /*!<@brief 1U pin index: 21 */
                              /* @} */

/*! @name PIO1_20 (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
#define BOARD_EMC_D9_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D9_PIN 20U /*!<@brief 1U pin index: 20 */
                             /* @} */

/*! @name PIO1_19 (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_EMC_D8_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_EMC_D8_PIN 19U /*!<@brief 1U pin index: 19 */
                             /* @} */

/*! @name PIO0_9 (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_EMC_D7_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D7_PIN 9U  /*!<@brief 0U pin index: 9 */
                             /* @} */

/*! @name PIO0_8 (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_EMC_D6_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D6_PIN 8U  /*!<@brief 0U pin index: 8 */
                             /* @} */

/*! @name PIO0_7 (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_EMC_D5_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D5_PIN 7U  /*!<@brief 0U pin index: 7 */
                             /* @} */

/*! @name PIO0_6 (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
#define BOARD_EMC_D4_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D4_PIN 6U  /*!<@brief 0U pin index: 6 */
                             /* @} */

/*! @name PIO0_5 (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
#define BOARD_EMC_D3_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D3_PIN 5U  /*!<@brief 0U pin index: 5 */
                             /* @} */

/*! @name PIO0_4 (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
#define BOARD_EMC_D2_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D2_PIN 4U  /*!<@brief 0U pin index: 4 */
                             /* @} */

/*! @name PIO0_3 (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
#define BOARD_EMC_D1_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_EMC_D1_PIN 3U  /*!<@brief 0U pin index: 3 */
                             /* @} */

