PaolaJocelyn/Puerto-COM_labview-Actor-Framework/Proyecto final labview/Proyecto final labview/board/pin_mux.h
/*! @name PIO2_14 (coord L7), J16[33]/P2_14-LCD_FP
  @{ */
#define BOARD_LCD_FP_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_FP_PIN 14U /*!<@brief 2U pin index: 14 */
                             /* @} */

/*! @name PIO2_13 (coord P7), J16[30]/P2_13-LCD_DCLK
  @{ */
#define BOARD_LCD_DCLK_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_DCLK_PIN 13U /*!<@brief 2U pin index: 13 */
                               /* @} */

/*! @name PIO2_16 (coord L8), J16[32]/P2_16-LCD_LP
  @{ */
#define BOARD_LCD_LP_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_LP_PIN 16U /*!<@brief 2U pin index: 16 */
                             /* @} */

/*! @name PIO2_15 (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M
  @{ */
#define BOARD_LCD_AC_ENAB_M_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_AC_ENAB_M_PIN 15U /*!<@brief 2U pin index: 15 */
                                    /* @} */

/*! @name PIO2_22 (coord K10), J16[9]/P2_22-LCD_VD4
  @{ */
#define BOARD_LCD_VD4_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD4_PIN 22U /*!<@brief 2U pin index: 22 */
                              /* @} */

/*! @name PIO2_21 (coord L10), J16[8]/P2_21-LCD_VD3
  @{ */
#define BOARD_LCD_VD3_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD3_PIN 21U /*!<@brief 2U pin index: 21 */
                              /* @} */

/*! @name PIO2_29 (coord G11), J16[16]/P2_29-LCD_VD11
  @{ */
#define BOARD_LCD_VD11_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD11_PIN 29U /*!<@brief 2U pin index: 29 */
                               /* @} */

/*! @name PIO2_25 (coord J11), J16[12]/P2_25-LCD_VD7
  @{ */
#define BOARD_LCD_VD7_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD7_PIN 25U /*!<@brief 2U pin index: 25 */
                              /* @} */

/*! @name PIO2_30 (coord F12), J16[17]/P2_30-LCD_VD12
  @{ */
#define BOARD_LCD_VD12_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD12_PIN 30U /*!<@brief 2U pin index: 30 */
                               /* @} */

/*! @name PIO2_28 (coord G13), J16[15]/P2_28-LCD_VD10
  @{ */
#define BOARD_LCD_VD10_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD10_PIN 28U /*!<@brief 2U pin index: 28 */
                               /* @} */

/*! @name PIO2_31 (coord D14), J16[18]/P2_31-LCD_VD13
  @{ */
#define BOARD_LCD_VD13_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD13_PIN 31U /*!<@brief 2U pin index: 31 */
                               /* @} */

/*! @name PIO2_24 (coord K14), J16[11]/P2_24-LCD_VD6
  @{ */
#define BOARD_LCD_VD6_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD6_PIN 24U /*!<@brief 2U pin index: 24 */
                              /* @} */

/*! @name PIO2_23 (coord M14), J16[10]/P2_23-LCD_VD5
  @{ */
#define BOARD_LCD_VD5_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_LCD_VD5_PIN 23U /*!<@brief 2U pin index: 23 */
                              /* @} */

/*! @name PIO3_0 (coord D12), J16[19]/JS36[1]/P3_0-LCD_VD14
  @{ */
#define BOARD_LCD_VD14_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD14_PIN 0U  /*!<@brief 3U pin index: 0 */
                               /* @} */

/*! @name PIO3_1 (coord D11), J16[20]/JS33[1]/P3_1-LCD_VD15
  @{ */
#define BOARD_LCD_VD15_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD15_PIN 1U  /*!<@brief 3U pin index: 1 */
                               /* @} */

/*! @name PIO3_5 (coord B10), J16[24]/P3_5-LCD_VD19
  @{ */
#define BOARD_LCD_VD19_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD19_PIN 5U  /*!<@brief 3U pin index: 5 */
                               /* @} */

/*! @name PIO3_6 (coord C9), J16[25]/P3_6-LCD_VD20
  @{ */
#define BOARD_LCD_VD20_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD20_PIN 6U  /*!<@brief 3U pin index: 6 */
                               /* @} */

/*! @name PIO3_7 (coord B8), J16[26]/P3_7-LCD_VD21
  @{ */
#define BOARD_LCD_VD21_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD21_PIN 7U  /*!<@brief 3U pin index: 7 */
                               /* @} */

/*! @name PIO3_8 (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
#define BOARD_LCD_VD22_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD22_PIN 8U  /*!<@brief 3U pin index: 8 */
                               /* @} */

/*! @name PIO3_9 (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
#define BOARD_LCD_VD23_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_LCD_VD23_PIN 9U  /*!<@brief 3U pin index: 9 */
                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void); /* Function assigned for the Cortex-M4F */

#define PIO017_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT7 0x07u        /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO226_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO226_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO410_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO410_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO411_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO412_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO412_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO413_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO413_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO414_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO414_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO415_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO415_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO48_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO48_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO4_8 (coord B14), U12[17]/JP11[1]/P4_8-ENET_TXD0
  @{ */
#define BOARD_INITENETPINS_ENET_TXD0_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_TXD0_PIN 8U  /*!<@brief 4U pin index: 8 */
                                             /* @} */

/*! @name PIO0_17 (coord E14), U12[18]/P0_17-ENET_TXD1
  @{ */
#define BOARD_INITENETPINS_ENET_TXD1_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITENETPINS_ENET_TXD1_PIN 17U /*!<@brief 0U pin index: 17 */
                                             /* @} */

