PaolaJocelyn/Puerto-COM_labview-Actor-Framework/Proyecto final labview/Proyecto final labview/board/pin_mux.h
/*! @name PIO4_13 (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
#define BOARD_INITENETPINS_ENET_TX_EN_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN 13U /*!<@brief 4U pin index: 13 */
                                              /* @} */

/*! @name PIO4_11 (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
#define BOARD_INITENETPINS_ENET_RXD0_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_RXD0_PIN 11U /*!<@brief 4U pin index: 11 */
                                             /* @} */

/*! @name PIO4_12 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
#define BOARD_INITENETPINS_ENET_RXD1_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_RXD1_PIN 12U /*!<@brief 4U pin index: 12 */
                                             /* @} */

/*! @name PIO4_10 (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
#define BOARD_INITENETPINS_ENET_CRS_DV_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN 10U /*!<@brief 4U pin index: 10 */
                                               /* @} */

/*! @name PIO4_16 (coord C4), U12[12]/P4_16-ENET_MDIO
  @{ */
#define BOARD_INITENETPINS_ENET_MDIO_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_MDIO_PIN 16U /*!<@brief 4U pin index: 16 */
                                             /* @} */

/*! @name PIO4_15 (coord A4), U12[13]/P4_15-ENET_MDC
  @{ */
#define BOARD_INITENETPINS_ENET_MDC_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_MDC_PIN 15U /*!<@brief 4U pin index: 15 */
                                            /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PORT 2U   /*!<@brief PORT device name: 2U */
#define BOARD_INITENETPINS_ENET_PHY_RSTn_PIN 26U   /*!<@brief 2U pin index: 26 */
                                                   /* @} */

/*! @name PIO4_14 (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
#define BOARD_INITENETPINS_ENET_RX_CLK_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_INITENETPINS_ENET_RX_CLK_PIN 14U /*!<@brief 4U pin index: 14 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void); /* Function assigned for the Cortex-M4F */

#define PIO12_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO13_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO13_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name PIO1_2 (coord L14), J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK
  @{ */
#define BOARD_PDM1_CLK_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_PDM1_CLK_PIN 2U  /*!<@brief 1U pin index: 2 */
                               /* @} */

/*! @name PIO1_3 (coord J13), JS26[3]/DMIC1[1]/P1_3-PDM1_DATA
  @{ */
#define BOARD_PDM1_DATA_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_PDM1_DATA_PIN 3U  /*!<@brief 1U pin index: 3 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M4F */

#define PIO218_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO218_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO219_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO219_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO311_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO311_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO41_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO41_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO42_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO42_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO43_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO43_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO4_1 (coord G14), U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK
  @{ */
#define BOARD_FC6_I2S_TX_SCK_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_FC6_I2S_TX_SCK_PIN 1U  /*!<@brief 4U pin index: 1 */
                                     /* @} */

/*! @name PIO4_3 (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS
  @{ */
#define BOARD_FC6_I2S_TX_WS_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_FC6_I2S_TX_WS_PIN 3U  /*!<@brief 4U pin index: 3 */
                                    /* @} */

/*! @name PIO4_2 (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA
  @{ */
#define BOARD_FC6_I2S_TX_DATA_PORT 4U /*!<@brief PORT device name: 4U */
#define BOARD_FC6_I2S_TX_DATA_PIN 2U  /*!<@brief 4U pin index: 2 */
                                      /* @} */

/*! @name PIO2_19 (coord P12), U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT
  @{ */
#define BOARD_FC7_I2S_RX_DAT_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_FC7_I2S_RX_DAT_PIN 19U /*!<@brief 2U pin index: 19 */
                                     /* @} */

/*! @name PIO2_18 (coord N10), U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK
  @{ */
#define BOARD_FC7_I2S_RX_SCK_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_FC7_I2S_RX_SCK_PIN 18U /*!<@brief 2U pin index: 18 */
                                     /* @} */

/*! @name PIO2_20 (coord P13), U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS
  @{ */
#define BOARD_FC7_I2S_RX_WS_PORT 2U /*!<@brief PORT device name: 2U */
#define BOARD_FC7_I2S_RX_WS_PIN 20U /*!<@brief 2U pin index: 20 */
                                    /* @} */

/*! @name PIO3_11 (coord B2), J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO
  @{ */
#define BOARD_MCLK_PORT 3U /*!<@brief PORT device name: 3U */
#define BOARD_MCLK_PIN 11U /*!<@brief 3U pin index: 11 */
                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
